Catalogs/ЛМ_Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_Адреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛМ_Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Улицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛМ_Адреса/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура СформироватьНаименование()
	Наименование = "";
	Если ЗначениеЗаполнено(Объект.Улица.Наименование) тогда
		Наименование = Объект.Улица.Наименование;
		Если ЗначениеЗаполнено(Объект.Дом) тогда
			Наименование = Наименование + ", "  + Объект.Дом;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Объект.Квартира) тогда
			Наименование = Наименование + ", кв."  + Объект.Квартира;
		КонецЕсли;	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Комментарий) тогда
		Наименование = СокрЛП(Наименование) + ?(СокрЛП(Наименование) = "", "", " ") + "(" + СокрЛП(Объект.Комментарий) + ")"
	КонецЕсли;	
	Объект.Наименование = СокрЛП(Наименование);
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Ф = ПолучитьФорму("Справочник.ЛМ_Улицы.Форма.ФормаВыбора", Новый Структура("Владелец",ГлКонтрагентАдресаДоставки),Элемент);
	Ф.Владелец = ГлКонтрагентАдресаДоставки; 
	Ф.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонецПроцедуры

&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
			Объект.Владелец = ГлКонтрагентАдресаДоставки;
		КонецЕсли;
	КонецПроцедуры
